<template>
  <div class="container">
    <div id="echartsRank" style="width: 100%; height: 350px;"></div>
    <div class="select">
      <select v-model="selectedYear" @change="updateChart">
      <option v-for="year in years" :key="year" :value="year">{{ year }}年</option>
    </select>
    </div>
    
  </div>
</template>

<script>
import echarts from 'echarts'
export default {
  name: 'echartsRank',
  data(){
    return{
      selectedYear: "2024",
      years: [2022, 2023, 2024], // 可以根据需要更新选择器中的年份,
      databeast:[] //热度数据
    }
  },
  mounted() {
   this.updateChart()
  },
  methods: {
    initChart() {
      const myChart = echarts.init(document.getElementById('echartsRank'))

    //数据
    let myData = [
    '黄山世界地质公园',
    '庐山世界地质公园',
    '云台山世界地质公园',
    '石林世界地质公园',
    '丹霞山世界地质公园',
    '张家界世界地质公园',
    '五大连池世界地质公园',
    '嵩山世界地质公园',
    '雁荡山世界地质公园',
    '泰宁世界地质公园',
    '克什克腾世界地质公园',
    '兴文世界地质公园',
    '泰山世界地质公园',
    '王屋山-黛眉山世界地质公园',
    '雷琼世界地质公园',
    '房山世界地质公园',
    '镜泊湖世界地质公园',
    '伏牛山世界地质公园',
    '龙虎山世界地质公园',
    '自贡世界地质公园',
    '秦岭终南山世界地质公园',
    '阿拉善沙漠世界地质公园',
    '乐业-凤山世界地质公园',
    '宁德世界地质公园',
    '天柱山世界地质公园',
    '香港世界地质公园',
    '三清山世界地质公园',
    '延庆世界地质公园',
    '神农架世界地质公园',
    '昆仑山世界地质公园',
    '苍山世界地质公园',
    '敦煌世界地质公园',
    '织金洞世界地质公园',
    '阿尔山世界地质公园',
    '可可托海世界地质公园',
    '光雾山-诺水河世界地质公园',
    '黄冈大别山世界地质公园',
    '沂蒙山世界地质公园',
    '九华山世界地质公园',
    '湘西世界地质公园',
    '张掖世界地质公园',
    '长白山世界地质公园',
    '龙岩世界地质公园',
    '武功山世界地质公园',
    '恩施大峡谷—腾龙洞世界地质公园',
    '兴义世界地质公园',
    '临夏世界地质公园'
];


let databeast = this.databeast

let timeLineData = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47];

function optiontitle(value) {
    if (value > 9) {
        return {
            text:  value + '小红书讨论热度',
            x: 'center',
            top: '2%'
        }
    } else return {
        text: value + '小红书讨论热度',
        x: 'center',
        top: '2%'
    }


}



  
    //图表加载
    let option = {
    baseOption: {

        timeline: {
            show: true,
            left:0,
            bottom: 10,
            width:900,
            axisType: 'category',
            tooltip: {
                show: true,
                formatter: function(params) {
                    console.log(params);
                    return params.name;
                }
            },
            autoPlay: true,
            currentIndex: 0,
            playInterval: 1000,
     
            label: {
                normal: {
                    show: true,
                    interval: 'auto',
                    formatter: function(value) {
                        return value
                    }
                },
            },
            data: [],
        },
        title: {
            //   text:'大北京景点帅哥美女统计', 
            textStyle: {
                fontSize: 16,
            },
        },

        grid: [{
            show: false,
            left: '5%',
            top: '20%',
            bottom: 80,
            containLabel: true,
        }],

        xAxis: [{
            boundaryGap: 0,
            type: 'category',
            data: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月','12月'],
            axisLabel: {
                show: true,
               
                textStyle: {
                    fontSize: 12,
                },
            },
            splitLine: {
                show: false
            },
        }],
        yAxis: [{
            type: 'value',
            name: '热度',
            min: 50,
            splitLine: {
                show: true
            },
            axisLabel: {
                formatter: function(value) {
                    return value + '0'
                },
            },
            data: myData,
        }],
        series: [],

    },

    options: [],


};

for (var i = 0; i < myData.length; i++) {
    option.baseOption.timeline.data.push(myData[i]);
    option.options.push({
        title: optiontitle(myData[i]),
        series: [{
            name: '总课时',
            type: 'line',
            barGap: 15,
            barWidth: 15,
            label: {
                normal: {
                    show: false,
                },
                emphasis: {
                    show: true,
                    position: 'left',
                    offset: [0, 0],
                    textStyle: {
                        color: '#fff',
                        fontSize: 14,
                    },
                },
            },
            areaStyle: {
                normal: {
                    color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                        offset: 0,
                        color: 'rgba(137, 189, 27, 0.3)'
                    }, {
                        offset: 0.8,
                        color: 'rgba(137, 189, 27, 0)'
                    }], false),
                    shadowColor: 'rgba(0, 0, 0, 0.1)',
                    shadowBlur: 10
                }
            },
            itemStyle: {
                normal: {
                    color: '#659F83',
                },
                emphasis: {
                    color: '#08C7AE',
                },
            },
            data: databeast[timeLineData[i]],
        }]
    });
}



myChart.setOption(option)
    },

    updateChart(){
      if(this.selectedYear=="2022"){
        console.log("2022")
        this.databeast = {
          1: [0,0,0,0,0,0,505,18,0,0,275,0
        ],2: [0,0,0,0,0,0,13,1219,0,0,22,0
        ],3: [0,0,0,0,341,45,1726,251,14,0,0,0
        ],4: [0,0,21,0,0,0,386,737,34,199,0,0
        ],5: [0,0,0,0,0,0,0,21,0,319,0,0
        ],6: [0,1,0,0,341,320,0,2796,237068,61,0,0
        ],7: [0,0,0,0,0,242,163,139,0,0,0,24
        ],8: [0,0,0,0,0,406,0,0,0,0,0,0
        ],9: [0,0,0,0,0,0,0,0,0,0,0,0
        ],10: [0,0,0,19,0,0,0,233,4,17,15,0
        ],11: [0,0,0,0,0,0,0,109,0,0,0,0
        ],12: [0,18,0,0,0,527,2606,21,0,445,0,0
        ],13: [0,0,0,0,97,0,152,0,40,0,0,0
        ],14: [0,0,0,0,1,21,2969,23,0,0,0,0
        ],15: [0,0,0,0,0,871,0,0,0,0,0,1402
        ],16: [0,0,0,0,0,0,192,15,14,14,349,116
        ],17: [0,0,0,0,0,0,0,1053,0,204,0,0
        ],18: [0,0,0,1375,0,0,0,0,0,0,0,0
        ],19: [0,0,17,0,121,0,14,0,34,24,0,9
        ],20: [0,0,0,0,297,285,563,129,0,25,23,0
        ],


  };

      }
      else if(this.selectedYear=="2023"){
        console.log("2023")
        this.databeast = {
    1: [9,0,0,5981,22346,32900,18849,24782,40104,21338,49467,5536],
    2: [526,82,13202,2688,4487,23365,2485,12903,8839,8766,7316,10355],
    3: [1091,0,670,216,1918,6453,33951,1863,116,2285,198,711],
    4: [277,0,90,0,496,3176,3536,2944,16376,2210,318,1466],
    5: [0,0,0,487,4480,2017,3228,13018,21751,4841,8697,6979],
    6: [2,1539,3511,0,465,4420,2997,5750,17016,3153,3906,64],
    7: [0,0,0,0,814,618,3077,1089,2695,1438,47,380],
    8: [0,0,1121,670,5431,13462,1896,947,2943,3997,10617,7080],
    9: [0,3,14,900,2453,514,924,2789,7772,1127,5805,1898],
    10: [25,45,0,99,1509,258,281,109,404,673,51,724],
    11: [ 0,878,0,24,2206,5422,35716,20737,7330,7482,5,240],
    12: [28,624,34,1391,2245,2453,3547,3735,33134,10236,150487,1323],
    13:[2,0,0,113,70961,69964,30568,15386,16282,39174,5949,757],
    14:[0,0,260,444,8069,3572,1697,27140,14506,8189,155219,14344],
    15:[343,952,0,7289,2252,5280,21628,3382,7493,6761,223129,48832],
    16:[0,0,7,430,2584,956,9022,4898,2505,1629,950,121],
    17:[0,0,44,12,2518,952,3023,777,163,1031,259,213],
    18:[0,0,11,194,1604,70,582,3486,9845,1049,133353,131],
    19:[89,65,78,224,519,207,290,3569,1622,6345,585,296],
    20:[129,575,0,0,9849,1011,3245,3334,9942,813,272,970],
    21:[],
    22:[],
    23:[],
    24:[],
    25:[],
    26:[],
    27:[],
    28:[],
    29:[],
    30:[],
    31:[],
    32:[],
    33:[],
    34:[],
    35:[],
    36:[],
    37:[],
    38:[],
    39:[],
    40:[],
    41:[],
    42:[],
    43:[],
    44:[],
    45:[],
    46:[],
    47:[],
    




};

      }
      else if(this.selectedYear=="2024"){
        console.log("2024")
        this.databeast = {
            1:[26387,44013,59749,68316],
            2:[13616,14125,22505,46961],
           3:[7990,4039,3465,3542],
            4:[2070,702,1334,5742],
            5:[24820,5114,124740,61076],
            6:[174,11220,15533,31884],
            7:[157,2005,92,2755],
            8:[2756,2080,6588,13353],
            9:[3747,9544,13050,15013],
            10:[152,12125,9186,2832],
            11:[1637,59924,14297,14191],
            12:[186,8622,42025,11433],
            13:[25899,7335,116359,84469],
            14:[547,60997,70427,84430],
            15:[22102,135258,37102,10215],
            16:[2543,55525,5899,7315],
            17:[534,410,97,596],
            18:[938,56136,32778,12930],
            19:[330,4552,1709,19393],
            20:[222,7419,38107,7310],
            21:[790,848,10972,49159],
            22:[175,2253,2913,8446],
            23:[301,2285,2245,14686],
            24:[1141,4154,2458,2919],
            25:[1059,4992,8546,32342],
            26:[17883,16862,82615,38831],
            27:[8661,25876,17089,19193],
            28:[0,1869,21753,20554],
            29:[1231,426,1210,10637],

    




};

      }
     
   
  
  this.initChart()

}

  }
}
</script>

<style lang="less">
.container{
    width: 100%;
    height: 400px;
    position: relative;
}
  .select{
   position: absolute;
   top: 0%;
  }
</style>
